#ifndef CARD_H_20241112_1509
#define CARD_H_20241112_1509

class Card
{
public:
	// 一応列挙体を作ってみたが、その必要はなかったかもしれない
	enum Trump
	{
		// ダイヤ
		DA = 0,
		D2 = 1,
		D3 = 2,
		D4 = 3,
		D5 = 4,
		D6 = 5,
		D7 = 6,
		D8 = 7,
		D9 = 8,
		D10 = 9,
		DJ = 10,
		DQ = 11,
		DK = 12,

		// スペード
		SA = 13,
		S2 = 14,
		S3 = 15,
		S4 = 16,
		S5 = 17,
		S6 = 18,
		S7 = 19,
		S8 = 20,
		S9 = 21,
		S10 = 22,
		SJ = 23,
		SQ = 24,
		SK = 25,

		// クラブ
		CA = 26,
		C2 = 27,
		C3 = 28,
		C4 = 29,
		C5 = 30,
		C6 = 31,
		C7 = 32,
		C8 = 33,
		C9 = 34,
		C10 = 35,
		CJ = 36,
		CQ = 37,
		CK = 38,

		// ハート
		HA = 39,
		H2 = 40,
		H3 = 41,
		H4 = 42,
		H5 = 43,
		H6 = 44,
		H7 = 45,
		H8 = 46,
		H9 = 47,
		H10 = 48,
		HJ = 49,
		HQ = 50,
		HK = 51,

		EMPTY = 52,
	};
};

#endif // !CARD_H_20241112_1509
